import { useSetRecoilState, useRecoilState } from "recoil";

import { talkState } from "state/talkState";
import { answerTextAtom } from "state/talkState";

export async function useTalkStateChange(state) {
  const setState = useSetRecoilState(talkState);
  const [answerText,setAnswerText] = useRecoilState(answerTextAtom);
//   console.log("State Change:" + state);
  switch (state) {
    // 状態 ------------------------------------------------------------------------
    case "開始":
      break;
    // 状態 ------------------------------------------------------------------------
    case "何する選択肢":
      break;
    // 状態 ------------------------------------------------------------------------
    case "じゃんけん":
      break;
    // 状態 ------------------------------------------------------------------------
    case "じゃんけん結果1":
      break;
    // 状態 ------------------------------------------------------------------------
    case "じゃんけん結果3":
      break;
    // 状態 ------------------------------------------------------------------------
    case "じゃんけん結果4":
      break;
    // 状態 ------------------------------------------------------------------------
    case "お話する":
      break;
    // 状態 ------------------------------------------------------------------------
    case "気になる単語":
      break;
    // 状態 ------------------------------------------------------------------------
    case "単語の詳細":
      break;
    // 状態 ------------------------------------------------------------------------
    case "最近覚えた単語":
      break;
    // 状態 ------------------------------------------------------------------------
    case "単語入力":
      break;
    // 状態 ------------------------------------------------------------------------
    case "単語入力後知っている単語分岐":
      break;
    // 状態 ------------------------------------------------------------------------
    case "単語入力後知らない単語分岐":
      break;
    // 状態 ------------------------------------------------------------------------
    case "褒める":
      break;
    // 状態 ------------------------------------------------------------------------
    case "間違いを指摘":
      break;
    // 状態 ------------------------------------------------------------------------
    case "意味入力後":
      break;
    // 状態 ------------------------------------------------------------------------
    case "意味を知っている単語がある":
      break;
    // 状態 ------------------------------------------------------------------------
    case "意味を知らない単語がある":
      break;
    default:
      console.error("state err:" + state);
      break;
  }

  setState(state)

//   console.log("11111:"+answer)
//   return new Promise(function(resolve) {
//       console.log("22222:"+answer)
//     resolve(answer)
//   })
}
